xml-v4/InformationRegisters/TL_СверкаПакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_СверкаПакета</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокНСИ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтрокДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаЦБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_ЦБ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС_БП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расхождение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_СтатусПакета</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодАЗС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСмены</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСмены</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОСЭНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/InformationRegisters/TL_ОшибкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>TL_ОшибкиЗагрузки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсточникUUID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ТипОбъектаИсточника</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поле</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_ПолеОшибки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.TL_КодОшибкиЗагрузки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

xml-v4/Enums/TL_СтатусПакета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TL_СтатусПакета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Валидирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоЦеликом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетПроверки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаблокированоМаппингом</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml-v4/Enums/TL_ПолеОшибки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TL_ПолеОшибки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Счёт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сумма</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml-v4/Enums/TL_КодОшибкиЗагрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>TL_КодОшибкиЗагрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НСИ_НеНайдена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтавкаНДС_НеСопоставлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СчётУчёта_НеОпределён</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаНеСходится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбязательноеПолеПусто</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидОперацииНеСопоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>STS_ОшибкаСервера</Name>
					<Comment>HTTP 500/502/503 от pos.autooplata.ru/tms — не настройка БП, обращаться в техподдержку STS</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>STS_ОшибкаАвторизации</Name>
					<Comment>Проверьте логин/пароль в Настройках TradeLedger → Подключение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>STS_ОшибкаСети</Name>
					<Comment>Проверьте подключение к интернету / VPN на сервере 1С</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаппингОплат_НеНайден</Name>
					<Comment>В STS пришёл новый pay_type без записи в TL_МаппингОплат — строки пропущены</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смена_БезПродаж</Name>
					<Comment>В STS sales[] пуст или у всех fuel volume=0. Реальных смен без продаж не бывает — это сбой передачи данных от станции/STS</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Смена_БезРозницы</Name>
					<Comment>Продажи в смене есть, но ни одна не попала в retail_cash/retail_card. Возможно, все retail-топлива имели неизвестный service_code или маппинг оплат отбросил все строки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Топливо_НеизвестныйКод</Name>
					<Comment>В sales[].fuel[].service.service_code пришло значение, которого нет в маппинге TL_Настройки.НайтиНоменклатуруТоплива (обычно 1/2/3 для АИ-92/АИ-95/ДТ). Возможно АИ-98 или брендовое топливо — добавьте в настройки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ_УжеЗагружен</Name>
					<Comment>Информация, не ошибка. Документ с тем же КлючЗагрузки уже есть в TL_СтатусыЗагрузки. Чтобы перезагрузить — сначала удалите его через «Удалить выбранные»</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переклассификация_Топлива</Name>
					<Comment>ТТН с отрицательными значениями — это переклассификация номенклатуры (например, ДТ зим. → ДТ при сезонном переходе). В паре с положительной ТТН того же номера в соседней смене. Документ автоматически не создаётся: бухгалтер делает Списание (−) и Оприходование (+) руками</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

xml-v4/CommonModules/TL_Сверка/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Общий модуль TL_Сверка
// Расширение ElsyPlus Ledger v6.0 для 1С:БП 3.0
// Контекст: Сервер
//
// Сверка пакета (TL_СверкаПакета) и журнал ошибок маппинга (TL_ОшибкиЗагрузки).
// Контракт §11–§12.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// ============================================================================
//  СВЕРКА ПАКЕТА
// ============================================================================

// Зафиксировать факт получения пакета (статус «Получен»).
// Вызывать в самом начале обработки.
//
// Параметры:
//   ИдентификаторПакета - Строка
//   Источник            - Строка - "ЭЛСИ.АЗК ЦБ"
//   ПериодС, ПериодПо   - Дата
//   КонтекстСмены       - Структура - {КодАЗС, НомерСмены, ДатаСмены, ОСЭНомер} (опц.)
//
Процедура ЗафиксироватьСтартПакета(ИдентификаторПакета, Источник, ПериодС = Неопределено,
	ПериодПо = Неопределено, КонтекстСмены = Неопределено) Экспорт

	Попытка
		МЗ = РегистрыСведений.TL_СверкаПакета.СоздатьМенеджерЗаписи();
		МЗ.ИдентификаторПакета = ИдентификаторПакета;
		МЗ.Прочитать();
		МЗ.ИдентификаторПакета = ИдентификаторПакета;
		МЗ.Источник = Источник;
		МЗ.ВремяЗагрузки = ТекущаяДата();
		Если ЗначениеЗаполнено(ПериодС) Тогда МЗ.ПериодС = ПериодС; КонецЕсли;
		Если ЗначениеЗаполнено(ПериодПо) Тогда МЗ.ПериодПо = ПериодПо; КонецЕсли;

		// Поля смены (формат пакета v2)
		Если ТипЗнч(КонтекстСмены) = Тип("Структура") Тогда
			Если КонтекстСмены.Свойство("КодАЗС") И ЗначениеЗаполнено(КонтекстСмены.КодАЗС) Тогда
				ЗаписатьРеквизитБезопасно(МЗ, "КодАЗС", КонтекстСмены.КодАЗС);
			КонецЕсли;
			Если КонтекстСмены.Свойство("НомерСмены") И ЗначениеЗаполнено(КонтекстСмены.НомерСмены) Тогда
				ЗаписатьРеквизитБезопасно(МЗ, "НомерСмены", КонтекстСмены.НомерСмены);
			КонецЕсли;
			Если КонтекстСмены.Свойство("ДатаСмены") И ЗначениеЗаполнено(КонтекстСмены.ДатаСмены) Тогда
				ЗаписатьРеквизитБезопасно(МЗ, "ДатаСмены", КонтекстСмены.ДатаСмены);
			КонецЕсли;
			Если КонтекстСмены.Свойство("ОСЭНомер") И ЗначениеЗаполнено(КонтекстСмены.ОСЭНомер) Тогда
				ЗаписатьРеквизитБезопасно(МЗ, "ОСЭНомер", КонтекстСмены.ОСЭНомер);
			КонецЕсли;
		КонецЕсли;

		МЗ.Статус = Перечисления.TL_СтатусПакета.Получен;
		МЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("TL_Сверка",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Не удалось записать сверку пакета " + ИдентификаторПакета + ": " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Безопасная запись реквизита регистра — если поле ещё не существует в БД
// (например, расширение накатано в файлы но F7 не сделан), не падать.
//
Процедура ЗаписатьРеквизитБезопасно(МенеджерЗаписи, ИмяРеквизита, Значение)
	Попытка
		МенеджерЗаписи[ИмяРеквизита] = Значение;
	Исключение
	КонецПопытки;
КонецПроцедуры

// Записать итоги сверки пакета.
// Вызывать в конце обработки.
//
// Параметры:
//   ИдентификаторПакета - Строка
//   Итоги               - Структура - см. РассчитатьИтоги()
//   Статус              - ПеречислениеСсылка.TL_СтатусПакета
//
Процедура ЗаписатьСверку(ИдентификаторПакета, Итоги, Статус, Комментарий = "") Экспорт

	Попытка
		МЗ = РегистрыСведений.TL_СверкаПакета.СоздатьМенеджерЗаписи();
		МЗ.ИдентификаторПакета = ИдентификаторПакета;
		МЗ.Прочитать();
		МЗ.ИдентификаторПакета = ИдентификаторПакета;

		Если Итоги.Свойство("Источник")        Тогда МЗ.Источник = Итоги.Источник; КонецЕсли;
		Если Итоги.Свойство("ПериодС")         Тогда МЗ.ПериодС = Итоги.ПериодС;   КонецЕсли;
		Если Итоги.Свойство("ПериодПо")        Тогда МЗ.ПериодПо = Итоги.ПериодПо; КонецЕсли;

		МЗ.ВремяЗагрузки   = ТекущаяДата();
		МЗ.СтрокНСИ        = ?(Итоги.Свойство("СтрокНСИ"), Итоги.СтрокНСИ, 0);
		МЗ.СтрокДокументов = ?(Итоги.Свойство("СтрокДокументов"), Итоги.СтрокДокументов, 0);
		МЗ.СуммаЦБ         = ?(Итоги.Свойство("СуммаЦБ"), Итоги.СуммаЦБ, 0);
		МЗ.НДС_ЦБ          = ?(Итоги.Свойство("НДС_ЦБ"), Итоги.НДС_ЦБ, 0);
		МЗ.СуммаБП         = ?(Итоги.Свойство("СуммаБП"), Итоги.СуммаБП, 0);
		МЗ.НДС_БП          = ?(Итоги.Свойство("НДС_БП"), Итоги.НДС_БП, 0);
		МЗ.Расхождение     = ?(Итоги.Свойство("Расхождение"), Итоги.Расхождение, 0);
		МЗ.Статус          = Статус;
		МЗ.Комментарий     = Лев(Комментарий, 500);
		МЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("TL_Сверка",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Сбой записи итоговой сверки пакета " + ИдентификаторПакета + ": " + ОписаниеОшибки());
	КонецПопытки;

КонецПроцедуры

// Рассчитать итоги пакета: суммы и НДС со стороны ЦБ (из JSON) и со стороны БП
// (по созданным/обновлённым документам).
//
// Параметры:
//   Пакет     - Соответствие - десериализованный JSON
//   Документы - Массив ссылок - созданные/обновлённые документы БП
//
// Возвращаемое значение:
//   Структура - {
//     СтрокНСИ, СтрокДокументов,
//     СуммаЦБ, НДС_ЦБ, СуммаБП, НДС_БП, Расхождение
//   }
//
Функция РассчитатьИтоги(Пакет, Документы) Экспорт

	Итоги = Новый Структура(
		"СтрокНСИ, СтрокДокументов, СуммаЦБ, НДС_ЦБ, СуммаБП, НДС_БП, Расхождение",
		0, 0, 0, 0, 0, 0, 0);

	НСИ = TL_HTTPКлиентЦБ.ПолучитьЗначениеИзJSON(Пакет, "НСИ", Неопределено);
	Если ТипЗнч(НСИ) = Тип("Массив") Тогда
		Итоги.СтрокНСИ = НСИ.Количество();
	КонецЕсли;

	ДокументыJSON = TL_HTTPКлиентЦБ.ПолучитьЗначениеИзJSON(Пакет, "Документы", Неопределено);
	Если ТипЗнч(ДокументыJSON) = Тип("Массив") Тогда
		Итоги.СтрокДокументов = ДокументыJSON.Количество();
		Для Каждого Док Из ДокументыJSON Цикл
			Сумма = TL_HTTPКлиентЦБ.ПолучитьЗначениеИзJSON(Док, "СуммаДокумента", 0);
			НДС   = TL_HTTPКлиентЦБ.ПолучитьЗначениеИзJSON(Док, "СуммаНДС", 0);
			Итоги.СуммаЦБ = Итоги.СуммаЦБ + ?(ТипЗнч(Сумма) = Тип("Число"), Сумма, 0);
			Итоги.НДС_ЦБ  = Итоги.НДС_ЦБ  + ?(ТипЗнч(НДС) = Тип("Число"),   НДС,   0);
		КонецЦикла;
	КонецЕсли;

	// Со стороны БП: суммируем по созданным документам
	Для Каждого СсылкаДок Из Документы Цикл
		Если Не ЗначениеЗаполнено(СсылкаДок) Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СсылкаДок,
				"СуммаДокумента");
			Итоги.СуммаБП = Итоги.СуммаБП + ?(ЗначениеЗаполнено(Реквизиты.СуммаДокумента),
				Реквизиты.СуммаДокумента, 0);
		Исключение
			// Если ОбщегоНазначения недоступно — читаем напрямую через Объект
			Попытка
				Объект = СсылкаДок.ПолучитьОбъект();
				Если Объект <> Неопределено Тогда
					Итоги.СуммаБП = Итоги.СуммаБП + Объект.СуммаДокумента;
				КонецЕсли;
			Исключение
			КонецПопытки;
		КонецПопытки;

		// НДС суммируем по табличной части Товары
		Попытка
			Запрос = Новый Запрос(
				"ВЫБРАТЬ
				|	СУММА(Т.СуммаНДС) КАК НДС
				|ИЗ
				|	Документ.ПоступлениеТоваровУслуг.Товары КАК Т
				|ГДЕ
				|	Т.Ссылка = &Ссылка");
			Запрос.УстановитьПараметр("Ссылка", СсылкаДок);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.НДС) Тогда
				Итоги.НДС_БП = Итоги.НДС_БП + Выборка.НДС;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЦикла;

	Итоги.Расхождение = Итоги.СуммаЦБ - Итоги.СуммаБП;

	Возврат Итоги;

КонецФункции

// Определить итоговый статус пакета на основе количества созданных документов и ошибок.
// Контракт §11.3.
//
// Параметры:
//   КоличествоДокументов - Число - сколько успешно создано/обновлено
//   КоличествоОшибок     - Число - сколько ошибок маппинга
//   ВсегоВПакете         - Число - сколько документов было в исходном пакете
//
// Возвращаемое значение:
//   ПеречислениеСсылка.TL_СтатусПакета
//
Функция ОпределитьСтатусПакета(КоличествоДокументов, КоличествоОшибок, ВсегоВПакете) Экспорт

	Если ВсегоВПакете = 0 Тогда
		// Пакет без документов — НСИ-only, технически принят
		Возврат Перечисления.TL_СтатусПакета.ПринятоЦеликом;
	КонецЕсли;

	Если КоличествоДокументов = ВсегоВПакете И КоличествоОшибок = 0 Тогда
		Возврат Перечисления.TL_СтатусПакета.ПринятоЦеликом;
	ИначеЕсли КоличествоДокументов > 0 Тогда
		Возврат Перечисления.TL_СтатусПакета.ПринятоЧастично;
	Иначе
		Возврат Перечисления.TL_СтатусПакета.Отклонено;
	КонецЕсли;

КонецФункции

// ============================================================================
//  ЖУРНАЛ ОШИБОК
// ============================================================================

// Записать ошибку в TL_ОшибкиЗагрузки.
// Контракт §12.
//
// Параметры:
//   Параметры - Структура - {
//     ИдентификаторПакета  (обяз.),
//     ИсточникUUID         (обяз.),
//     ТипОбъекта           - ПеречислениеСсылка.TL_ТипОбъектаИсточника,
//     Поле                 - ПеречислениеСсылка.TL_ПолеОшибки,
//     КодОшибки            - ПеречислениеСсылка.TL_КодОшибкиЗагрузки,
//     ЗначениеИсточника    - Строка,
//     СообщениеОшибки      - Строка,
//     Документ             - Произвольный (опц.)
//   }
//
Процедура ЗаписатьОшибку(Параметры) Экспорт

	Попытка
		// Подсчитать следующий номер записи в пакете
		Запрос = Новый Запрос(
			"ВЫБРАТЬ МАКСИМУМ(Т.НомерЗаписи) КАК Макс
			|ИЗ РегистрСведений.TL_ОшибкиЗагрузки КАК Т
			|ГДЕ Т.ИдентификаторПакета = &Пакет");
		Запрос.УстановитьПараметр("Пакет", Параметры.ИдентификаторПакета);
		Выборка = Запрос.Выполнить().Выбрать();
		НомерЗаписи = 1;
		Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Макс) Тогда
			НомерЗаписи = Выборка.Макс + 1;
		КонецЕсли;

		МЗ = РегистрыСведений.TL_ОшибкиЗагрузки.СоздатьМенеджерЗаписи();
		МЗ.ИдентификаторПакета = Параметры.ИдентификаторПакета;
		МЗ.НомерЗаписи         = НомерЗаписи;
		МЗ.ИсточникUUID        = Лев(СтрокоеЗначение(Параметры, "ИсточникUUID"), 36);
		МЗ.ТипОбъекта          = ПолучитьЗначение(Параметры, "ТипОбъекта",
			Перечисления.TL_ТипОбъектаИсточника.ПустаяСсылка());
		МЗ.Поле                = ПолучитьЗначение(Параметры, "Поле",
			Перечисления.TL_ПолеОшибки.Прочее);
		МЗ.КодОшибки           = ПолучитьЗначение(Параметры, "КодОшибки",
			Перечисления.TL_КодОшибкиЗагрузки.Прочее);
		МЗ.ЗначениеИсточника   = Лев(СтрокоеЗначение(Параметры, "ЗначениеИсточника"), 200);
		МЗ.СообщениеОшибки     = Лев(СтрокоеЗначение(Параметры, "СообщениеОшибки"), 500);
		МЗ.ВремяРегистрации    = ТекущаяДата();
		Если Параметры.Свойство("Документ") И ЗначениеЗаполнено(Параметры.Документ) Тогда
			МЗ.Документ = Параметры.Документ;
		КонецЕсли;
		МЗ.Записать();
	Исключение
		ЗаписьЖурналаРегистрации("TL_Сверка",
			УровеньЖурналаРегистрации.Ошибка, , ,
			"Сбой записи в TL_ОшибкиЗагрузки: " + ОписаниеОшибки()
			+ Символы.ПС + "Параметры: " + ОписаниеПараметровДляЛога(Параметры));
	КонецПопытки;

КонецПроцедуры

// Сводка недостающей НСИ — дедуплицированный список того, что бухгалтеру надо
// завести в БП ГИГ (по журналу TL_ОшибкиЗагрузки). Одна и та же недостающая НСИ
// по многим сменам схлопывается в одну строку с подсчётом смен/записей — чтобы
// бухгалтер видел уникальные задачи и приоритет (по скольким сменам блокирует).
// Канал НЕ создаёт НСИ сам — только показывает, чего не хватает.
//
// Параметры:
//   НачалоПериода - Дата - фильтр по ВремяРегистрации (Неопределено = весь журнал)
//   КонецПериода  - Дата
//
// Возвращаемое значение:
//   ТаблицаЗначений (ТипОбъекта, КодОшибки, Значение, Сообщение, КолСмен, КолЗаписей),
//   отсортированная по убыванию числа затронутых смен.
//
Функция ПолучитьСводкуНедостающейНСИ(НачалоПериода = Неопределено, КонецПериода = Неопределено) Экспорт

	БезПериода = (НачалоПериода = Неопределено);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОшЗ.ТипОбъекта КАК ТипОбъекта,
	|	ОшЗ.КодОшибки КАК КодОшибки,
	|	ОшЗ.СообщениеОшибки КАК Сообщение,
	|	МАКСИМУМ(ОшЗ.ЗначениеИсточника) КАК Значение,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ОшЗ.ИдентификаторПакета) КАК КолСмен,
	|	КОЛИЧЕСТВО(*) КАК КолЗаписей
	|ИЗ
	|	РегистрСведений.TL_ОшибкиЗагрузки КАК ОшЗ
	|ГДЕ
	|	(&БезПериода ИЛИ ОшЗ.ВремяРегистрации МЕЖДУ &НП И &КП)
	|СГРУППИРОВАТЬ ПО
	|	ОшЗ.ТипОбъекта, ОшЗ.КодОшибки, ОшЗ.СообщениеОшибки
	|УПОРЯДОЧИТЬ ПО
	|	КолСмен УБЫВ, Сообщение";
	Запрос.УстановитьПараметр("БезПериода", БезПериода);
	Запрос.УстановитьПараметр("НП", ?(БезПериода, '00010101', НачалоДня(НачалоПериода)));
	Запрос.УстановитьПараметр("КП",
		?(БезПериода, '39991231', КонецДня(?(КонецПериода = Неопределено, НачалоПериода, КонецПериода))));

	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("КодОшибки",  Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("Значение",   Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("Сообщение",  Новый ОписаниеТипов("Строка"));
	Таб.Колонки.Добавить("КолСмен",    Новый ОписаниеТипов("Число"));
	Таб.Колонки.Добавить("КолЗаписей", Новый ОписаниеТипов("Число"));

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = Таб.Добавить();
		Стр.ТипОбъекта = Строка(Выборка.ТипОбъекта);
		Стр.КодОшибки  = Строка(Выборка.КодОшибки);
		Стр.Значение   = Строка(Выборка.Значение);
		Стр.Сообщение  = Строка(Выборка.Сообщение);
		Стр.КолСмен    = Выборка.КолСмен;
		Стр.КолЗаписей = Выборка.КолЗаписей;
	КонецЦикла;

	Возврат Таб;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЗначение(Структура, Ключ, Умолчание)
	Если Структура.Свойство(Ключ) И ЗначениеЗаполнено(Структура[Ключ]) Тогда
		Возврат Структура[Ключ];
	КонецЕсли;
	Возврат Умолчание;
КонецФункции

Функция СтрокоеЗначение(Структура, Ключ, Умолчание = "")
	Если Структура.Свойство(Ключ) Тогда
		Возврат Строка(Структура[Ключ]);
	КонецЕсли;
	Возврат Умолчание;
КонецФункции

Функция ОписаниеПараметровДляЛога(Параметры)
	Текст = "";
	Для Каждого КЗ Из Параметры Цикл
		Текст = Текст + КЗ.Ключ + "=" + Лев(Строка(КЗ.Значение), 80) + "; ";
	КонецЦикла;
	Возврат Лев(Текст, 400);
КонецФункции

#КонецОбласти
